In [10]:
# 제곱 사용자 함수
def my_sq(x) :
    return x ** 2

my_sq(2)

4

In [11]:
# n제곱 사용자 함수
def my_exp(x, n) :
    return x ** n

my_exp(2, 4)

16

### 판다스 apply 함수

In [1]:
import pandas as pd

In [9]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})
print(df)

    a   b
0  10  20
1  20  30
2  30  40

* 시리즈에 apply 메소드 사용

In [12]:
#  제곱함수 적용
sq = df['a'].apply(my_sq)
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [16]:
# my_sq = x ** 2
df['a'].apply(lambda x : x ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [20]:
exp = df['a'].apply(my_exp, n=2)
print(exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [22]:
# my_exp = x ** n
df['a'].apply(lambda x, n: x ** n, n=2)

0    100
1    400
2    900
Name: a, dtype: int64

In [24]:
def print_me(x) :
    print(x)
    
print(df.apply(print_me, axis=0), '\n')   # 열방향
print(df.apply(print_me, axis=1))   # 행방향

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64
0    None
1    None
2    None
dtype: object

In [32]:
print(df.apply(lambda x : print(x), axis = 0), '\n')
print(df.apply(lambda x : print(x), axis = 1))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64
0    None
1    None
2    None
dtype: object

In [34]:
df['a+b'] = df.apply(lambda x : x['a'] + x['b'], axis = 1)
df

    a   b  a+b
0  10  20   30
1  20  30   50
2  30  40   70

* 데이터프레임에 apply 메서드 사용

In [35]:
def avg_3(x,y,z):
    return (x + y + z) / 3

print(df.apply(avg_3, y=1, z=2))

           a          b        a+b
0   4.333333   7.666667  11.000000
1   7.666667  11.000000  17.666667
2  11.000000  14.333333  24.333333

In [36]:
def avg_3_apply(col) :
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z) / 3

print(df.apply(avg_3_apply))

a      20.0
b      30.0
a+b    50.0
dtype: float64

### 데이터프레임 누락값 처리 후 apply 메소드 사용

In [37]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [38]:
import numpy as np

def count_missing(vec) :
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

cmis_col = titanic.apply(count_missing)
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [41]:
# 누락값 비율 계산
def prop_missing(vec) :
    num = count_missing(vec)
    dem = vec.size
    return round((num / dem)*100, 2)

pmis_col = titanic.apply(prop_missing)
pmis_col

survived        0.00
pclass          0.00
sex             0.00
age            19.87
sibsp           0.00
parch           0.00
fare            0.00
embarked        0.22
class           0.00
who             0.00
adult_male      0.00
deck           77.22
embark_town     0.22
alive           0.00
alone           0.00
dtype: float64

* 각 행의 누락값 개수를 확인하여 데이터 추가

In [43]:
# apply 메소드 행 방향으로 적용
titanic['num_missing'] = titanic.apply(count_missing, axis = 1)
titanic.iloc[:5, list(range(11))+[-1]]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,1